app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "content", "created_at", "updated_at") VALUES (1, 'commento prova', '2025-10-23 15:27:50.227367', '2025-10-23 15:27:50.227367') RETURNING "id"
---
  def create
    puts "comment_params: #{comment_params.inspect}"
    comment = @post.comments.new(comment_params)
    if comment.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
---
  def set_post
    @post = Post.find(params[:post_id])