app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.includes(:likes, :user).all

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ('Primo', 'Questo è il primo post.', '2025-10-23 15:15:33.565565', '2025-10-23 15:15:33.565565') RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

DELETE FROM "posts" WHERE "posts"."id" = 1
---
  def destroy
    @post.destroy!

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
---
    def set_post
      @post = Post.includes(:likes).find(params[:id])